app/Modules/Produk/Models/ProdukModel.php

    public function getAllProduk() {
        return $this->db->table('produk')
            ->select('produk.*, kategori.nama_kategori as nama_kategori')
            ->join('kategori', 'kategori.id = produk.kategori_id')
            ->get()
            ->getResultArray();
---
SELECT `produk`.*, `kategori`.`nama_kategori` as `nama_kategori`
FROM `produk`
JOIN `kategori` ON `kategori`.`id` = `produk`.`kategori_id`