app/Models/MahasiswaModel.php

SELECT *
FROM `mahasiswa`
---
    public function getAllData() {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        return $builder->get()->getResult();

INSERT INTO `mahasiswa` (`Nim`, `Nama_Mhs`, `Jenis_Kelamin`, `Tgl_Lahir`) VALUES ('2311016110001', 'Zidan', 'Laki-laki', '2008-06-19')
---
    public function insertData($data) {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        return $builder->insert($data);