app/Modules/Dosen/Models/DosenModel.php

    public function getAllData() {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        return $builder->get()->getResult();
---
SELECT *
FROM `dosen`